shl-emacs.org
#+title: GNU Emacs Configuration
#+author: Sebastian Hempel Linde
#+email: sebastian@hempellinde.com

* =early-init.el=

#+begin_src emacs-lisp :tangle "early-init.el"
;;; early-init.el --- -*- lexical-binding: t -*-
;;; Commentary
;;; Code:
#+end_src

#+begin_src emacs-lisp :tangle "early-init.el"
;; Disable package.el
(setq package-enable-at-startup nil)
#+end_src

** Garbage Collection

#+begin_src emacs-lisp :tangle "early-init.el"
(setq gc-cons-percentage 0.6)
(setq gc-cons-threshold most-positive-fixnum)
#+end_src

** Initial Appearance

#+begin_src emacs-lisp :tangle "early-init.el"
(setq inhibit-startup-message t)

(setq default-frame-alist
      '((menu-bar-lines . 0)
	(tool-bar-lines . 0)
	(horizontal-scroll-bars)
	(vertical-scroll-bars)))
#+end_src

#+begin_src emacs-lisp :tangle "early-init.el"
(provide 'early-init)
;;; early-init.el ends here
#+end_src

* =init.el=

#+begin_src emacs-lisp :tangle "init.el"
;;; init.el --- -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src

** Variables

#+begin_src emacs-lisp :tangle "init.el"
(defconst my-emacs-d (file-name-as-directory user-emacs-directory)
  "Directory of emacs.d.")

(defconst my-site-lisp-dir (concat my-emacs-d "site-lisp")
  "Directory of site-lisp.")

(defconst my-lisp-dir (concat my-emacs-d "lisp")
  "Directory of personal configuration.")
#+end_src

** Module Loading

#+begin_src emacs-lisp :tangle "init.el"
(defun require-init (pkg &optional maybe-disabled)
  "Load PKG if MAYBE-DISABLED is nil or it's nil but start up in normal slowly."
  (when (or (not maybe-disabled) (not my-lightweight-mode-p))
    (load (file-truename (format "%s/%s" my-lisp-dir pkg)) t t)))
#+end_src

Load modules.

#+begin_src emacs-lisp :tangle "init.el"
  (let* ((file-name-handler-alist nil))
    (require-init 'shl-package)
    (require-init 'shl-startup)
    (require-init 'shl-appearance)
    (require-init 'shl-defaults)
    (require-init 'shl-minibuffer)
    (require-init 'shl-editing)
    (require-init 'shl-development)
    (require-init 'shl-vc)
    (require-init 'shl-python)
    (require-init 'shl-org)
    (require-init 'shl-misc))
#+end_src

* =shl/package=

#+begin_src emacs-lisp :tangle "lisp/shl-package.el"
;;; shl-package.el --- -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

(require 'package)
(require 'cl-lib)

;; Add MELPA to package-archives
(add-to-list 'package-archives '( "melpa" . "https://melpa.org/packages/") t)
#+end_src

** Package Installation Functions

The following functions eases the installation of packages in two ways:
+ ~require-package~ makes it easier to install a package with ~min-version~ and to specify whether or not to refresh the package archives.
+ ~maybe-require-package~ is for packages that you want to install but are not necessary.

#+begin_src emacs-lisp :tangle "lisp/shl-package.el"
(defun require-package (package &optional min-version no-refresh)
  "Install given PACKAGE, optionally requiring MIN-VERSION.
If NO-REFRESH is non-nil, the available package lists will not be
re-downloaded in order to locate PACKAGE."
  (when (stringp min-version)
    (setq min-version (version-to-list min-version)))
  (or (package-installed-p package min-version)
      (let* ((known (cdr (assoc package package-archive-contents)))
             (best (car (sort known (lambda (a b)
                                      (version-list-<= (package-desc-version b)
                                                       (package-desc-version a)))))))
        (if (and best (version-list-<= min-version (package-desc-version best)))
            (package-install best)
          (if no-refresh
              (error "No version of %s >= %S is available" package min-version)
            (package-refresh-contents)
            (require-package package min-version t)))
        (package-installed-p package min-version))))

(defun maybe-require-package (package &optional min-version no-refresh)
  "Try to install PACKAGE, and return non-nil if successful.
In the event of failure, return nil and print a warning message.
Optionally require MIN-VERSION.  If NO-REFRESH is non-nil, the
available package lists will not be re-downloaded in order to
locate PACKAGE."
  (condition-case err
      (require-package package min-version no-refresh)
    (error
     (message "Couldn't install optional package `%s': %S" package err)
     nil)))
#+end_src

** =package.el= Initialization

#+begin_src emacs-lisp :tangle "lisp/shl-package.el"
(setq package-enable-at-startup nil)
(setq package-native-compile t)
(package-initialize)

;; package.el updates the saved version of package-selected-packages correctly only
;; after custom-file has been loaded, which is a bug. We work around this by adding
;; the required packages to package-selected-packages after startup is complete.

(defvar shl/required-packages nil)

(defun shl/note-selected-package (oldfun package &rest args)
  "If OLDFUN reports PACKAGE was successfully installed, note that fact.
The package name is noted by adding it to
`shl/required-packages'.  This function is used as an
advice for `require-package', to which ARGS are passed."
  (let ((available (apply oldfun package args)))
    (prog1
        available
      (when available
        (add-to-list 'shl/required-packages package)))))

(advice-add 'require-package :around 'shl/note-selected-package)


(when (fboundp 'package--save-selected-packages)
  (require-package 'seq)
  (add-hook 'after-init-hook
            (lambda ()
              (package--save-selected-packages
               (seq-uniq (append shl/required-packages package-selected-packages))))))


(let ((package-check-signature nil))
  (require-package 'gnu-elpa-keyring-update))
#+end_src

** Package Menu Customization

#+begin_src emacs-lisp :tangle "lisp/shl-package.el"
(defun shl/set-tabulated-list-column-width (col-name width)
  "Set any column with name COL-NAME to the given WIDTH."
  (when (> width (length col-name))
    (cl-loop for column across tabulated-list-format
             when (string= col-name (car column))
             do (setf (elt column 1) width))))

(defun shl/maybe-widen-package-menu-columns ()
  "Widen some columns of the package menu table to avoid truncation."
  (when (boundp 'tabulated-list-format)
    (shl/set-tabulated-list-column-width "Version" 13)
    (let ((longest-archive-name (apply 'max (mapcar 'length (mapcar 'car package-archives)))))
      (shl/set-tabulated-list-column-width "Archive" longest-archive-name))))

(add-hook 'package-menu-mode-hook 'shl/maybe-widen-package-menu-columns)
#+end_src

#+begin_src emacs-lisp :tangle "lisp/shl-package.el"
(provide 'shl-package)
;;; shl-package.el ends here
#+end_src

* =shl/startup=

#+begin_src emacs-lisp :tangle "lisp/shl-startup.el"
;;; shl-startup.el --- -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

(require-package 'diminish)

(when (fboundp 'pixel-scroll-precision-mode)
  (pixel-scroll-precision-mode))
#+end_src

** Performance

#+begin_src emacs-lisp :tangle "lisp/shl-startup.el"
(when (require-package 'gcmh)
  (setq gcmh-high-cons-threshold (* 128 1024 1024))
  (add-hook 'after-init-hook (lambda ()
                               (gcmh-mode)
                               (diminish 'gcmh-mode))))

(setq jit-lock-defer-time 0)
#+end_src

#+begin_src emacs-lisp :tangle "lisp/shl-startup.el"
(provide 'shl-startup)
;;; shl-startup.el ends here
#+end_src

* =shl/appearance=

#+begin_src emacs-lisp :tangle "lisp/shl-appearance.el"
;;; shl-appearance.el --- -*- lexical-binding: t -*-
;;; Code:
;;; Commentary:
#+end_src

** Theme

#+begin_src emacs-lisp :tangle "lisp/shl-appearance.el"
;; Don't ask if theme is safe
(setopt custom-safe-themes t)

;; Install theme
(require-package 'ef-themes)

;; Customize ef-themes
(setq ef-themes-mixed-fonts t
      ef-themes-variable-pitch-ui t)



;; Modeline
(defun shl/ef-themes-mode-line ()
  "Tweak the style of the modeline"
  (ef-themes-with-colors
    (custom-set-faces
     `(mode-line ((,c :background ,bg-active :foreground ,fg-main :box (:line-width 1 :color ,fg-dim))))
     `(mode-linde-inactive ((,c box (:line-width 1 :color ,bg-active)))))))
(add-hook 'ef-themes-post-load-hook #'shl/ef-themes-mode-line)


;; Load theme (ef-themes-select also calls ef-themes-post-load-hook)
(ef-themes-select 'ef-deuteranopia-light)

;; Enabling toggling
(setq ef-themes-to-toggle '(ef-deuteranopia-light ef-deuteranopia-dark))
(global-set-key (kbd "C-c h t") 'ef-themes-toggle)

#+end_src

** Font

#+begin_src emacs-lisp :tangle "lisp/shl-appearance.el"
(push '(font . "Iosevka Comfy") default-frame-alist)
(set-face-font 'default "Iosevka Comfy")
(set-face-font 'variable-pitch "Iosevka Comfy")
(copy-face 'default 'fixed-pitch)
#+end_src

** Misc

#+begin_src emacs-lisp :tangle "lisp/shl-appearance.el"
(when (fboundp 'display-line-numbers-mode)
  (setq-default display-line-numbers-width 3)
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (add-hook 'org-mode-hook 'display-line-numbers-mode))

(when (boundp 'display-fill-column-indicator)
  (setq-default indicate-buffer-boundaries 'left)
  (setq-default display-fill-column-indicator-character ?┊)
  (add-hook 'prog-mode-hook 'display-fill-column-indicator-mode))
#+end_src

** Modeline

#+begin_src emacs-lisp :tangle "lisp/shl-appearance.el"
(display-time-mode)
(display-battery-mode)
#+end_src

#+begin_src emacs-lisp :tangle "lisp/shl-appearance.el"
(provide 'shl-appearance)
;;; shl-appearance.el ends here
#+end_src

* =shl/defaults=

#+begin_src emacs-lisp :tangle "lisp/shl-defaults.el"
;;; shl-defaults.el --- -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src

** PATH

#+begin_src emacs-lisp :tangle "lisp/shl-defaults.el"
(require-package 'exec-path-from-shell)

(when (or (memq window-system '(mac ns x pgtk))
          (unless (memq system-type '(ms-dos windows-nt))
            (daemonp)))
  (exec-path-from-shell-initialize))
#+end_src

** Misc

#+begin_src emacs-lisp :tangle "lisp/shl-defaults.el"
(setq-default bookmark-default-file (locate-user-emacs-file ".bookmarks.el")
	      buffer-menu-max-size 30
	      case-fold-search t
	      column-number-mode t
	      indent-tabs-mode nil
	      create-lockfiles nil
	      auto-save-default nil
	      make-backup-files nil
	      vc-make-backup-files nil
	      save-interprogram-paste-before-kill t
	      scroll-preserve-screen-position 'always
              truncate-lines nil
              truncate-partial-width-windows nil)

;; Speed up font rendering for special characters
;; @see https://www.reddit.com/r/emacs/comments/988paa/emacs_on_windows_seems_lagging/
(setq inhibit-compacting-font-caches t)

;; GUI Frames
(setq use-file-dialog nil)
(setq use-dialog-box nil)

;; Savehist
(savehist-mode 1)



(require 'window)

(defun hsplit-last-buffer ()
  "Focus to the last created horizontal window."
  (interactive)
  (split-window-horizontally)
  (other-window 1))

(defun vsplit-last-buffer ()
  "Focus to the last created vertical window."
  (interactive)
  (split-window-vertically)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'vsplit-last-buffer)
(global-set-key (kbd "C-x 3") 'hsplit-last-buffer)

(global-set-key [remap kill-buffer] 'kill-this-buffer)
#+end_src

*** Hooks

#+begin_src emacs-lisp :tangle "lisp/shl-defaults.el"
(add-hook 'after-init-hook 'delete-selection-mode)

;; Automatically revert buffers when file changes on disk
(add-hook 'after-init-hook 'global-auto-revert-mode)
(setq global-auto-revert-non-file-buffers t
      auto-revert-verbose nil)
(with-eval-after-load 'autorevert
  (diminish 'auto-revert-mode))

;; Highlighted region is highlighted with the 'region' face
(add-hook 'after-init-hook 'transient-mark-mode)
#+end_src

#+begin_src emacs-lisp :tangle "lisp/shl-defaults.el"
(provide 'shl-defaults)
;;; shl-defaults.el ends here
#+end_src

* =shl/editing=

#+begin_src emacs-lisp :tangle "lisp/shl-editing.el"
;;; shl-editing.el --- -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:
#+end_src

** Defaults

#+begin_src emacs-lisp :tangle "lisp/shl-editing.el"
(when (fboundp 'electric-pair-mode)
  (add-hook 'after-init-hook 'electric-pair-mode))
(add-hook 'after-init-hook 'electric-indent-mode)

;; Newlines
(defun sanityinc/newline-at-end-of-line ()
  "Move to end of line, enter a newline, and reindent."
  (interactive)
  (move-end-of-line 1)
  (newline-and-indent))

(global-set-key (kbd "S-<return>") 'sanityinc/newline-at-end-of-line)

;; Subword-mode enables moving in CamelCase and snake_case
(add-hook 'after-init-hook 'subword-mode)
(with-eval-after-load 'subword
  (diminish 'subword-mode))
#+end_src

Using avy makes jumping around far more effective

#+begin_src emacs-lisp :tangle "lisp/shl-editing.el"
(when (maybe-require-package 'avy)
  (global-set-key (kbd "M-j") 'avy-goto-char-timer))
#+end_src

** Kill Ring

#+begin_src emacs-lisp :tangle "lisp/shl-editing.el"
(require-package 'browse-kill-ring)

(setq browse-kill-ring-separator "\f")
(global-set-key (kbd "M-Y") 'browse-kill-ring)

(with-eval-after-load 'browse-kill-ring
  (define-key browse-kill-ring-mode-map (kbd "C-g") 'browse-kill-ring-quit)
  (define-key browse-kill-ring-mode-map (kbd "M-n") 'browse-kill-ring-forward)
  (define-key browse-kill-ring-mode-map (kbd "M-p") 'browse-kill-ring-previous))
  
(with-eval-after-load 'page-break-lines
  (add-to-list 'page-break-lines-modes 'browse-kill-ring-mode))
#+end_src



#+begin_src emacs-lisp :tangle "lisp/shl-editing.el"
(provide 'shl-editing)
;;; shl-editing.el ends here
#+end_src

* =shl/org=

#+begin_src emacs-lisp :tangle "lisp/shl-org.el"
  ;;; shl-org.el --- -*- lexical-binding: t -*-
  ;;; Commentary:
  ;;; Code:
(require-package 'org)

(maybe-require-package 'org-cliplink)
#+end_src

** Bindings

#+begin_src emacs-lisp :tangle "lisp/shl-org.el"
(define-key global-map (kbd "C-c l") 'org-store-link)
(define-key global-map (kbd "C-c c") 'org-capture)
(define-key global-map (kbd "C-c a") 'org-agenda)

(with-eval-after-load 'org
  (define-key org-mode-map [remap goto-line] 'consult-org-heading))

;; Org Prefix Map
(defvar shl/org-global-prefix-map (make-sparse-keymap)
  "A keymap for global access to org helpers.")

(define-key shl/org-global-prefix-map (kbd "j") 'org-clock-goto)
(define-key shl/org-global-prefix-map (kbd "l") 'org-clock-in-last)
(define-key shl/org-global-prefix-map (kbd "i") 'org-clock-in)
(define-key shl/org-global-prefix-map (kbd "o") 'org-clock-out)
(define-key global-map (kbd "C-c o") shl/org-global-prefix-map)
#+end_src

